#03082020 [03-08-2020]
set_clock_groups -name asynchronous -asynchronous -group [get_clocks [get_clocks -of_objects [get_pins zynq_soc_i/CLK_GEN_148MHZ/inst/mmcm_adv_inst/CLKOUT0]]] -group [get_clocks *clk_fpga*]
create_generated_clock -name io_hdmio_clk -source [get_pins zynq_soc_i/HDMI_OUTPUT/HDMI/U0/V6_GEN.ODDR_hdmi_clk_o/C] -divide_by 1 -invert [get_ports io_hdmio_clk]
set_false_path -from [get_ports *pixclk*]
set_false_path -from [get_clocks clk_fpga_2] -to [get_clocks clk_fpga_0]


#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_select_reg[sumprod_Bn][k1][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_add_reg[add_12563947_13_10][*]/D}] 16.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_select_reg[sumprod_Bn][k*][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_add_reg[add_*][*]/D}] 16.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/blu_select_reg[sumprod_Bn][k*][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/blu_add_reg[add_*][*]/D}] 16.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/gre_select_reg[sumprod_Bn][k*][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/gre_add_reg[add_*][*]/D}] 16.000

#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_select_reg[sumprod_Bn][k1][3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_add_reg[add_1256394][10]/D}] 16.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/blu_select_reg[sumprod_Bn][k2][3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/blu_add_reg[add_1256][11]/D}] 16.000

#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_select_reg[sumprod_Bn][k*][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/red_add_reg[add_12563947_13_10][*]/D}] 16.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/blu_select_reg[sumprod_Bn][k*][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/blu_add_reg[add_12563947_13_10][*]/D}] 16.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/gre_select_reg[sumprod_Bn][k*][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/F_RE2_FRAME_ENABLE.recolor_space_2_inst/gre_add_reg[add_12563947_13_10][*]/D}] 16.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[blue][*]/D}] 1.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[green][*]/D}] 1.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[red][*]/D}] 1.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[red][*]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[green][*]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[blue][*]/D}] 7.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[blue][5]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[green][5]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[red][5]/D}] 7.000


set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[blue][6]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[green][6]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[red][6]/D}] 7.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[blue][7]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[green][7]/D}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/axis_external_inst/vfpConfigInst/wrRegsOut_reg[cfigReg5][21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/videoSelectInst/channels_reg[red][7]/D}] 7.000

set_max_delay -from [get_pins zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop0/CLK] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[4]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/S}] 54.000

set_max_delay -from [get_pins zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop_reg/CLK] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[2]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop0/CLK] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/D}] 54.000
set_max_delay -from [get_pins zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop0/CLK] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/D}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[green][3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueTop_reg/PCIN[*]}] 7.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop_reg[16]__0/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop_reg/CLK] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/D}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[4]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/D}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[green][3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueTop_reg/PCIN[*]}] 7.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[4]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueTop_reg[16]__0/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/D}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[2]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/D}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[green][3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueTop_reg/PCIN[*]}] 7.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[2]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[0]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[0]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[4]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[7]/D}] 54.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[2]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[0]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[1]/S}] 54.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[21]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[0]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[1]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[2]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[3]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[4]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[5]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[6]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[1]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[7]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[2]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[3]/S}] 54.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 0.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/uFiXhueBot_reg[3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSV_FRAME_ENABLE.hsvInst/hueQuot1x_reg[*]/S}] 54.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/uFiXhueBot_reg[3]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/video_stream_inst/frameProcessInst/FiltersInst/filter_kernel_inst/HSL_FRAME_ENABLE.hslInst/hueQuot1x_reg[*]/S}] 54.000
